---
kind: method
id: M:Autodesk.Revit.DB.Form.IsVertexReference(Autodesk.Revit.DB.Reference)
zh: 对话框、窗口、窗体
source: html/2c4dabd2-7353-b3ac-f1b6-f94e96487d27.htm
---
# Autodesk.Revit.DB.Form.IsVertexReference Method

**中文**: 对话框、窗口、窗体

Tell if the pick is the reference to a vertex of the form.

## Syntax (C#)
```csharp
public bool IsVertexReference(
	Reference vertexReference
)
```

## Parameters
- **vertexReference** (`Autodesk.Revit.DB.Reference`) - Reference to be checked.